MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
    if (HAL_UART_Init(&huart3) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief DMA Initialization Function
 * @param None
 * @retval None
 */
static void MX_DMA_Init(void)
{
    /* DMA controller clock enable */
    __HAL_RCC_DMA1_CLK_ENABLE();

    /* DMA interrupt init */
    /* DMA1_Stream0_IRQn - SAI2_A RX */
    HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);
    /* DMA1_Stream1_IRQn - SAI2_B TX */
    HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);
}

/**
 * @brief SAI2 Initialization Function (I2S Audio Input/Output)
 *
 * SAI2_A: Slave Receiver - receives I2S from BM83
 *   - Pins: PD13 (SCK), PD12 (FS), PD11 (SD)
 *   - Mode: Slave, receives clock from BM83 (external master)
 *
 * SAI2_B: Slave Transmitter - outputs I2S to DAC
 *   - Pin: PA0 (SD)
 *   - Mode: Synchronous slave to SAI2_A (shares clock)
 *
 * @param None
 * @retval None
 */
static void MX_SAI2_Init(void)
{
    /* -------- SAI2 Block A - Slave Receiver (I2S Input) -------- */
    /* Using FREE protocol for full control over I2S timing */
    hsai_rx.Instance = SAI2_Block_A;
    hsai_rx.Init.Protocol = SAI_FREE_PROTOCOL;
    hsai_rx.Init.AudioMode = SAI_MODESLAVE_RX;
    hsai_rx.Init.DataSize = SAI_DATASIZE_16;
    hsai_rx.Init.FirstBit = SAI_FIRSTBIT_MSB;
    hsai_rx.Init.ClockStrobing = SAI_CLOCKSTROBING_RISINGEDGE;
    hsai_rx.Init.Synchro = SAI_ASYNCHRONOUS;
    hsai_rx.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLE;
    hsai_rx.Init.NoDivider = SAI_MASTERDIVIDER_DISABLE;
    hsai_rx.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_1QF;
    hsai_rx.Init.AudioFrequency = SAI_AUDIO_FREQUENCY_44K;
    hsai_rx.Init.SynchroExt = SAI_SYNCEXT_DISABLE;
    hsai_rx.Init.MonoStereoMode = SAI_STEREOMODE;
    hsai_rx.Init.CompandingMode = SAI_NOCOMPANDING;
    hsai_rx.Init.TriState = SAI_OUTPUT_NOTRELEASED;

    /* Frame: 32 bits total (16 left + 16 right), I2S Philips style */
    hsai_rx.FrameInit.FrameLength = 32;
    hsai_rx.FrameInit.ActiveFrameLength = 16;
    hsai_rx.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
    hsai_rx.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
    hsai_rx.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

    /* Slots: 2 x 16-bit */
    hsai_rx.SlotInit.FirstBitOffset = 0;
    hsai_rx.SlotInit.SlotSize = SAI_SLOTSIZE_16B;
    hsai_rx.SlotInit.SlotNumber = 2;
    hsai_rx.SlotInit.SlotActive = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;

    if (HAL_SAI_Init(&hsai_rx) != HAL_OK)
    {
        Error_Handler();
    }

    /* Disable ALL error interrupts - in slave mode we trust external sync */
    __HAL_SAI_DISABLE_IT(&hsai_rx, SAI_IT_OVRUDR | SAI_IT_AFSDET | SAI_IT_LFSDET | SAI_IT_WCKCFG);
    __HAL_SAI_DISABLE_IT(&hsai_tx, SAI_IT_OVRUDR | SAI_IT_AFSDET | SAI_IT_LFSDET | SAI_IT_WCKCFG);

    /* -------- SAI2 Block B - Slave Transmitter (I2S Output) -------- */
    /* Synchronized to Block A */
    hsai_tx.Instance = SAI2_Block_B;
    hsai_tx.Init.Protocol = SAI_FREE_PROTOCOL;
    hsai_tx.Init.AudioMode = SAI_MODESLAVE_TX;
    hsai_tx.Init.DataSize = SAI_DATASIZE_16;
    hsai_tx.Init.FirstBit = SAI_FIRSTBIT_MSB;
    hsai_tx.Init.ClockStrobing = SAI_CLOCKSTROBING_FALLINGEDGE;
    hsai_tx.Init.Synchro = SAI_SYNCHRONOUS;
    hsai_tx.Init.OutputDrive = SAI_OUTPUTDRIVE_ENABLE;
    hsai_tx.Init.NoDivider = SAI_MASTERDIVIDER_DISABLE;
    hsai_tx.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_1QF;
    hsai_tx.Init.AudioFrequency = SAI_AUDIO_FREQUENCY_44K;
    hsai_tx.Init.SynchroExt = SAI_SYNCEXT_DISABLE;
    hsai_tx.Init.MonoStereoMode = SAI_STEREOMODE;
    hsai_tx.Init.CompandingMode = SAI_NOCOMPANDING;
    hsai_tx.Init.TriState = SAI_OUTPUT_NOTRELEASED;

    /* Frame: same as RX (Philips) */
    hsai_tx.FrameInit.FrameLength = 32;
    hsai_tx.FrameInit.ActiveFrameLength = 16;
    hsai_tx.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
    hsai_tx.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
    hsai_tx.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

    /* Slots: same as RX */
    hsai_tx.SlotInit.FirstBitOffset = 0;
    hsai_tx.SlotInit.SlotSize = SAI_SLOTSIZE_16B;
    hsai_tx.SlotInit.SlotNumber = 2;
    hsai_tx.SlotInit.SlotActive = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;

    if (HAL_SAI_Init(&hsai_tx) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief GPIO Initialization Function
 * @param None
 * @retval None
 */
static void MX_GPIO_Init(void)
{
    /* GPIO clocks are enabled in HAL_xxx_MspInit() callbacks */
}

/**
 * @brief  Audio processing function - called for each buffer
 *         Currently just passes through (echo) for testing
 * @param  rx_buf: Pointer to received audio samples (16-bit)
 * @param  tx_buf: Pointer to transmit audio samples (16-bit)
 * @param  samples: Number of samples (L+R interleaved)
 * @retval None
 */
volatile uint32_t audio_process_count = 0;

/* Simple sine wave lookup table (256 entries, one full cycle) */
static const int16_t sine_table[256] = {
    0, 804, 1608, 2410, 3212, 4011, 4808, 5602, 6393, 7179,
    7962, 8739, 9512, 10278, 11039, 11793, 12539, 13279, 14010, 14732,
    15446, 16151, 16846, 17530, 18204, 18868, 19519, 20159, 20787, 21403,
    22005, 22594, 23170, 23731, 24279, 24811, 25329, 25832, 26319, 26790,
    27245, 27683, 28105, 28510, 28898, 29268, 29621, 29956, 30273, 30571,
    30852, 31113, 31356, 31580, 31785, 31971, 32137, 32285, 32412, 32521,
    32609, 32678, 32728, 32757, 32767, 32757, 32728, 32678, 32609, 32521,
    32412, 32285, 32137, 31971, 31785, 31580, 31356, 31113, 30852, 30571,
    30273, 29956, 29621, 29268, 28898, 28510, 28105, 27683, 27245, 26790,
    26319, 25832, 25329, 24811, 24279, 23731, 23170, 22594, 22005, 21403,
    20787, 20159, 19519, 18868, 18204, 17530, 16846, 16151, 15446, 14732,
    14010, 13279, 12539, 11793, 11039, 10278, 9512, 8739, 7962, 7179,
    6393, 5602, 4808, 4011, 3212, 2410, 1608, 804, 0, -804,
    -1608, -2410, -3212, -4011, -4808, -5602, -6393, -7179, -7962, -8739,
    -9512, -10278, -11039, -11793, -12539, -13279, -14010, -14732, -15446, -16151,
    -16846, -17530, -18204, -18868, -19519, -20159, -20787, -21403, -22005, -22594,
    -23170, -23731, -24279, -24811, -25329, -25832, -26319, -26790, -27245, -27683,
    -28105, -28510, -28898, -29268, -29621, -29956, -30273, -30571, -30852, -31113,
    -31356, -31580, -31785, -31971, -32137, -32285, -32412, -32521, -32609, -32678,
    -32728, -32757, -32767, -32757, -32728, -32678, -32609, -32521, -32412, -32285,
    -32137, -31971, -31785, -31580, -31356, -31113, -30852, -30571, -30273, -29956,
    -29621, -29268, -28898, -28510, -28105, -27683, -27245, -26790, -26319, -25832,
    -25329, -24811, -24279, -23731, -23170, -22594, -22005, -21403, -20787, -20159,
    -19519, -18868, -18204, -17530, -16846, -16151, -15446, -14732, -14010, -13279,
    -12539, -11793, -11039, -10278, -9512, -8739, -7962, -7179, -6393, -5602,
    -4808, -4011, -3212, -2410, -1608, -804
};
